spec/cassettes/Create_payment_on_successful_charge/creates_the_payment_with_reference_id.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_103ksb246B16QpMhVrPzfY1L
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.10.1
      Authorization:
      - Bearer sk_test_wXHjXOVRvynH1l5Je59xV94F
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.10.1","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"i686-linux","publisher":"stripe","uname":"Linux
        rails-dev-box 3.2.0-23-generic-pae #36-Ubuntu SMP Tue Apr 10 22:19:09 UTC
        2012 i686 i686 i386 GNU/Linux"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Sat, 29 Mar 2014 15:38:27 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1465'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_103ksb246B16QpMhVrPzfY1L",
          "created": 1396101017,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_103ksb246B16QpMhmh0fyOKs",
              "object": "charge",
              "created": 1396101017,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "card": {
                "id": "card_103ksb246B16QpMh3CsCrY7P",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 11,
                "exp_year": 2014,
                "fingerprint": "1yVFObGxyd7k5MW8",
                "customer": "cus_3ksbApWAZi3WgN",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              },
              "captured": true,
              "refunds": [],
              "balance_transaction": "txn_103ksb246B16QpMhkQyenOZz",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_3ksbApWAZi3WgN",
              "invoice": "in_103ksb246B16QpMh9XeewnZw",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_description": "Myflix Fee"
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_3ksbNCC2eGmc3Z"
        }
    http_version: 
  recorded_at: Sat, 29 Mar 2014 15:38:27 GMT
recorded_with: VCR 2.8.0
